In [5]:
import pandas as pd

In [12]:
# dataframe

data = {
    'First Name': ['Josuan Leonardo','Angela','Keith'],
    'Last Name': ['Hulom','Lepiten','Espinosa'],
    'Age': [20,20,22]
}

studentDf = pd.DataFrame(data)

In [13]:
studentDf

        First Name Last Name  Age
0  Josuan Leonardo     Hulom   20
1           Angela   Lepiten   20
2            Keith  Espinosa   22

In [16]:
studentDf.to_csv('student.csv', index=False)
studentDf.to_excel('student.xlsx', index=False)

In [30]:
df1 = pd.DataFrame({
    'ID': [1,2,3],
    'Name': ['Mike','Chad','John Doe']
})

df2 = pd.DataFrame({
    'ID': [1,21,3],
    'Category': ['A','B','A'],
    'Value': [10,20,30]
})

In [31]:
df1.set_index('ID', inplace=True)
df2.set_index('ID', inplace=True)

joined_df = df1.join(df2, how='inner')

In [32]:
joined_df

        Name Category  Value
ID
1       Mike        A     10
3   John Doe        A     30

In [37]:
df = pd.DataFrame({'ID':[1,2,3],
                   'Category':['A','B','C'],
                   'Value':[10,20,30]})

pivot_df = df.pivot(index='ID', columns='Category', values='Value')
# pivot_df

melted_df = pd.melt(df, id_vars=['ID'], value_vars=['Category','Value'])
melted_df

   ID  variable value
0   1  Category     A
1   2  Category     B
2   3  Category     C
3   1     Value    10
4   2     Value    20
5   3     Value    30